//Тема4 
/*Объявите две переменные: admin и name.
Запишите строку "Джон" в переменную name.
Скопируйте значение из переменной name в admin.
Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).
*/
let name='Джон'
let admin
admin=name
alert(name)
/*Создайте переменную для названия нашей планеты. Как бы вы её назвали?
Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?
*/
const planetEarth;
let currentUser;
/* birthday можно использовать верхний регистр, так как значение известно и не меняется
age неизвестна до подсчетов, поэтому лучше через нижний регистр */
const BIRTHDAY;
const age;
//Тема 5 Что выведет этот скрипт?
let name = "Ilya";

alert( `hello ${1}` ); // 1

alert( `hello ${"name"}` ); // name

alert( `hello ${name}` ); // Ilya
//тема 6  Что выведет 
"" + 1 + 0 // '10'
"" - 1 + 0 //-1
true + false // 1
6 / "3" // 2
"2" * "3" // 6
4 + 5 + "px" //9px
"$" + 4 + 5 // $45
"4" - 2 //2
"4px" - 2 // NaN
7 / 0 //Infinity
"  -9  " + 5 // " -9  5"
"  -9  " - 5 // -14
null + 1 //1
undefined + 1 //undefined
" \t \n" - 2 //-2

